app/Controllers/Admin/MemberAdminController.php

SELECT *
FROM `tbl_member`
WHERE `tbl_member`.`member_id` = '2'
---
        $link = strip_tags(htmlspecialchars($this->request->getPost('link'), ENT_QUOTES));
        $desc = strip_tags(htmlspecialchars($this->request->getPost('desc'), ENT_QUOTES));
        // Cek Foto
        $member = $this->memberModel->find($member_id);

UPDATE `tbl_member` SET `member_name` = 'PBNU', `member_link` = 'https://www.nu.or.id/', `member_desc` = '2024', `member_image` = '1693756217_066b9dc109239e230513.png'
WHERE `tbl_member`.`member_id` IN ('2')
---
            $fileFoto->move('assets/backend/images/member/', $namaFotoUpload);
        }
        // Simpan ke database
        $this->memberModel->update($member_id, [
            'member_name' => $nama,
            'member_link' => $link,
            'member_desc' => $desc,
            'member_image' => $namaFotoUpload
        ]);