app/Controllers/Admin/PostAdminController.php

        $slug = strip_tags(htmlspecialchars($this->request->getPost('slug'), ENT_QUOTES));
        $description = strip_tags(htmlspecialchars($this->request->getPost('description'), ENT_QUOTES));

        if ($this->postModel->where('post_slug', $slug)->get()->getNumRows() > 1) {
---
SELECT *
FROM `tbl_post`
WHERE `post_slug` = 'postingan-kelima-dengan-kategori-berita'

        }

        // Cek foto
        $postAwal = $this->postModel->find($post_id);
---
SELECT *
FROM `tbl_post`
WHERE `tbl_post`.`post_id` = '5'