app/Controllers/Admin/SliderAdminController.php

SELECT *
FROM `tbl_inbox`
WHERE `inbox_status` = 0
SELECT *
FROM `tbl_comment`
WHERE `comment_status` = 0
SELECT *
FROM `tbl_slider`
---
    public function index()
    {

        $data = [
            'akun' => $this->akun,
            'title' => 'All Slider',
            'active' => $this->active,
            'total_inbox' => $this->inboxModel->where('inbox_status', 0)->get()->getNumRows(),
            'inboxs' => $this->inboxModel->where('inbox_status', 0)->findAll(),
            'total_comment' => $this->commentModel->where('comment_status', 0)->get()->getNumRows(),
            'comments' => $this->commentModel->where('comment_status', 0)->findAll(),
            'helper_text' => helper('text'),
            'breadcrumbs' => $this->request->getUri()->getSegments(),

            'sliders' => $this->sliderModel->findAll()