app/Controllers/ContactController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
---
    public function index()
    {
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'title' => 'Kontak',
            'active' => 'Contact'
        ];