app/Controllers/HomeController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
SELECT *
FROM `tbl_testimonial`
---
    public function index()
    {
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'testimonials' => $this->testimonialModel->findAll(),
            'members' => $this->memberModel->findAll(),
            'sliders' => $this->sliderModel->findAll(),
            'latest_posts' => $this->postviewModel->getLatestPosts(),
            // 'posts' => $this->postviewModel->paginate(3, 'posts'),
            'pager' => $this->postviewModel->pager,
            'validation' => \Config\Services::validation(),
            'title' => 'Home',
            'active' => 'Home'
        ];