app/Controllers/LoginController.php

SELECT *
FROM `tbl_user`
WHERE `user_email` = 'admin@gmail.com'
 LIMIT 1
---
    public function validasi()
    {
        // Ngambil inputan
        $email = htmlspecialchars($this->request->getPost('email'));
        $password = htmlspecialchars($this->request->getPost('password'));

        if (!$this->validate([
            'email' => [
                'rules' => 'required|valid_email',
                'errors' => [
                    'required' => 'Kolom {field} harus diisi!',
                    'valid_email' => 'Kolom {field} harus berformat email'
                ]
            ],
            'password' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kolom {field} harus diisi!'
                ]
            ]
        ])) {
            return redirect()->to('/login')->with('pesan', 'email atau password salah');
        }
        $userModel = new UserModel();
        $user = $userModel->where('user_email', $email)->first();