app/Controllers/PostController.php

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
SELECT *
FROM `tbl_category`
SELECT *
FROM `tbl_tags`
---
    public function index($slug = null)
    {
        if ($slug == null) {
            $data = [
                'site' => $this->siteModel->find(1),
                'home' => $this->homeModel->find(1),
                'about' => $this->aboutModel->find(1),
                // 'posts' => $this->postviewModel->findAll(),
                'posts' => $this->postviewModel->getAllPosts(),
                // 'posts' => $this->postviewModel->paginate(3, 'posts'),
                'pager' => $this->postviewModel->pager,
                'title' => 'Rilis Berita',
                'active' => 'Post'
            ];
            return view('posts/post_view', $data);
        }
        if (!$this->postviewModel->get_post_by_slug($slug)->getRowArray()) {
            return redirect()->to('post');
        }
        $post = $this->postviewModel->get_post_by_slug($slug)->getRowArray();
        $post_tags = explode(',', $post['post_tags']);
        $post_id = $post['post_id'];
        $category_id = $post['category_id'];
        $user_ip = $_SERVER['REMOTE_ADDR'];
        $cek_ip = $this->postviewModel->query("SELECT * FROM tbl_post_views WHERE view_ip='$user_ip' AND view_post_id='$post_id' AND DATE(view_date)=CURDATE()")->getNumRows();
        if ($cek_ip < 1) {
            $this->postviewModel->count_views($user_ip, $post_id);
        }
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'post' => $post,
            'post_tags' => $post_tags,
            'related_post' => $this->postviewModel->get_related_post($category_id, $post_id)->getResultArray(),
            'categories' => $this->categoryModel->findAll(),
            'tags' => $this->tagModel->findAll(),

SELECT *
FROM `tbl_site`
WHERE `tbl_site`.`site_id` = 1
SELECT *
FROM `tbl_home`
WHERE `tbl_home`.`home_id` = 1
SELECT *
FROM `tbl_about`
WHERE `tbl_about`.`about_id` = 1
---
    public function search()
    {
        $query = $this->request->getGet('search_query');
        if (!$query) {
            return redirect()->to('/post');
        }
        $result = $this->postviewModel->search_post($query);
        if ($result->getNumRows() < 1) {
            $posts = $result->getResultArray();
            $keyword = "Keyword '$query' tidak ditemukan";
        } else {
            $posts = $result->getResultArray();
            $keyword = "$query ";
        }
        $data = [
            'site' => $this->siteModel->find(1),
            'home' => $this->homeModel->find(1),
            'about' => $this->aboutModel->find(1),
            'title' => 'Search',
            'keyword' => $keyword,
            'posts' => $posts,
            'active' => 'Post'
        ];