app/Models/PostviewModel.php

    public function getLatestPosts($limit = 4)
    {
        $this->orderBy('post_date', 'DESC')
             ->where(['post_status' => 1]);

        return $this->paginate($limit, 'posts');
---
SELECT COUNT(*) AS `numrows`
FROM `v_post`
WHERE `post_status` = 1

    public function getAllPosts($limit = 3)
    {
        $this->orderBy('post_date', 'DESC')
             ->where(['post_status' => 1]);

        return $this->paginate($limit, 'posts');
---
SELECT COUNT(*) AS `numrows`
FROM `v_post`
WHERE `post_status` = 1