app/Models/VisitorModel.php

    function count_all_visitors()
    {
        $query = $this->db->table('tbl_visitors')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_visitors`

    function count_all_post_views()
    {
        $query = $this->db->table('tbl_post_views')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_post_views`

    function count_all_posts()
    {
        $query = $this->db->table('tbl_post')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_post`

    function count_all_comments()
    {
        $query = $this->db->table('tbl_comment')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_comment`